In [15]:
import sqlite3

connection = sqlite3.connect('test.db')
cursor = connection.cursor()

cursor.execute('''
CREATE TABLE IF NOT EXISTS EMPLOYEES(
    ID INTEGER PRIMARY KEY,
    NAME TEXT NOT NULL,
    AGE INTEGER NOT NULL,
    DEPARTMENT TEXT
)
''')

cursor.execute('''
INSERT INTO EMPLOYEES(NAME,AGE,DEPARTMENT)
VALUES('VAIBHAV',22,'BB')                  
''')

cursor.execute('''
INSERT INTO EMPLOYEES(NAME,AGE,DEPARTMENT)
VALUES('DANISH',21,'CS')                  
''')

cursor.execute('''
INSERT INTO EMPLOYEES(NAME,AGE,DEPARTMENT)
VALUES('DIYA',20,'MBBS')                  
''')

cursor.execute('''
INSERT INTO EMPLOYEES(NAME,AGE,DEPARTMENT)
VALUES('MAYUR',24,'MBBS')                  
''')

cursor.execute('''
INSERT INTO EMPLOYEES(NAME,AGE,DEPARTMENT)
VALUES('SUHAS',42,'CS')                  
''')

cursor.execute('SELECT * FROM EMPLOYEES')
rows = cursor.fetchall()

for row in rows:
    print(row)

def fetch_employees_by_department(department_name):
    cursor.execute(
                 f"SELECT * FROM EMPLOYEES WHERE department = '{department_name}'" 
                   )
    data = cursor.fetchall()
    for d in data:
        print(d)
     
fetch_employees_by_department('BB')

(1, 'VAIBHAV', 22, 'BB')
(3, 'DIYA', 20, 'MBBS')
(4, 'MAYUR', 24, 'MBBS')
(5, 'SUHAS', 42, 'CS')
(6, 'VAIBHAV', 22, 'BB')
(7, 'DANISH', 21, 'CS')
(8, 'DIYA', 20, 'MBBS')
(9, 'MAYUR', 24, 'MBBS')
(10, 'SUHAS', 42, 'CS')
(11, 'VAIBHAV', 22, 'BB')
(12, 'DANISH', 21, 'CS')
(13, 'DIYA', 20, 'MBBS')
(14, 'MAYUR', 24, 'MBBS')
(15, 'SUHAS', 42, 'CS')
(1, 'VAIBHAV', 22, 'BB')
(6, 'VAIBHAV', 22, 'BB')
(11, 'VAIBHAV', 22, 'BB')

In [11]:
cursor.execute('''
UPDATE EMPLOYEES
SET DEPARTMENT = 'BB'
WHERE ID = 2               
''')
connection.commit()

In [14]:
cursor.execute('''
DELETE FROM EMPLOYEES
WHERE ID = 2             
''')
connection.commit()

In [19]:
cursor.execute('SELECT * FROM EMPLOYEES')
dataset = cursor.fetchall()

for d in dataset:
    print(d)

(1, 'VAIBHAV', 22, 'BB')
(3, 'DIYA', 20, 'MBBS')
(4, 'MAYUR', 24, 'MBBS')
(5, 'SUHAS', 42, 'CS')
(6, 'VAIBHAV', 22, 'BB')
(7, 'DANISH', 21, 'CS')
(8, 'DIYA', 20, 'MBBS')
(9, 'MAYUR', 24, 'MBBS')
(10, 'SUHAS', 42, 'CS')
(11, 'VAIBHAV', 22, 'BB')
(12, 'DANISH', 21, 'CS')
(13, 'DIYA', 20, 'MBBS')
(14, 'MAYUR', 24, 'MBBS')
(15, 'SUHAS', 42, 'CS')

In [21]:
cursor.execute('''
SELECT * FROM EMPLOYEES WHERE AGE > 30               
''')
d = cursor.fetchall()
for x in d:
    print(x)

(5, 'SUHAS', 42, 'CS')
(10, 'SUHAS', 42, 'CS')
(15, 'SUHAS', 42, 'CS')

In [22]:
cursor.execute('''
SELECT * FROM employees WHERE name LIKE '%V%';               
''')

tmp = cursor.fetchall()
for t in tmp:
    print(t)

(1, 'VAIBHAV', 22, 'BB')
(6, 'VAIBHAV', 22, 'BB')
(11, 'VAIBHAV', 22, 'BB')

In [ ]:
dmp = [
    ('a',10,'BB'),
    ('b',11,'CS'),
    ('c',12,'MT'),
    ('d',13,'AM'),
    ('e',14,'CH'),
]

try:
    connection.execute("BEGIN TRANSACTION;")
    
    cursor.executemany('''
    INSERT INTO EMPLOYEES(NAME, AGE, DEPARTMENT)
    VALUES(?,?,?)  
    ''',dmp)

    connection.commit()
except Exception as e:
    connection.rollback()
    print(e)

In [27]:
updates = [
    (99,'a'),
    (99,'b'),
    (99,'c')
]

try:
    connection.execute("Begin Transaction;")
    
    cursor.executemany('''
    UPDATE EMPLOYEES
    SET AGE = ?
    WHERE NAME = ?
    ''', updates)
    
    connection.commit()
except Exception as e:
    connection.rollback()
    print(e)

In [ ]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS DEPARTMENTS
ID INTEGER PRIMARY KEY,
NAME TEXT NOT NULL               
''')

cursor.execute('''
UPDATE EMPLOYEES
SET ID = (SELECT ID FROM DEPARTMENTS WHERE NAME = EMPLOYEES.DEPARTMENT)
WHERE DEPARTMENT IS NOT NULL               
''')